# Predictive-Policing-in-the-London-Metropolitan-Police-District

## 1. Environment Setup

### 1. 1. Update Linux Packages

In [ ]:
!sudo apt update

### 1. 2. Install Python and Packages (pip & venv)

In [ ]:
!sudo apt install -y python3 python3-pip python3-venv

### 1. 3. Create a Virtual Environment

In [ ]:
!python3 -m venv .venv

### 1. 4. Activate the Virtual Environment

In [ ]:
!source .venv/bin/activate

### 1.5. Install the Required Python Packages

In [ ]:
%pip install -r requirements.txt

### 1. 6. Create Folders to Store Datasets

In [ ]:
import os

# Raw Data Files
os.makedirs("Datasets", exist_ok=True)
os.makedirs("Datasets/Raw-Data", exist_ok=True)
os.makedirs("Datasets/Raw-Data/Police-Data", exist_ok=True)
os.makedirs("Datasets/Raw-Data/Map-Data", exist_ok=True)
os.makedirs("Datasets/Raw-Data/Income-Data", exist_ok=True)
os.makedirs("Datasets/Raw-Data/Population-Data", exist_ok=True)
os.makedirs("Datasets/Raw-Data/Weather-Data", exist_ok=True)

# Data For Processing

os.makedirs("Datasets/Data-For-Processing", exist_ok=True)
os.makedirs("Datasets/Data-For-Processing/Police-Data", exist_ok=True)
os.makedirs("Datasets/Data-For-Processing/Map-Data", exist_ok=True)
os.makedirs("Datasets/Data-For-Processing/Income-Data", exist_ok=True)
os.makedirs("Datasets/Data-For-Processing/Population-Data", exist_ok=True)
os.makedirs("Datasets/Data-For-Processing/Weather-Data", exist_ok=True)

# Processed Data Files
os.makedirs("Datasets/Processed-Data", exist_ok=True)
os.makedirs("Datasets/Processed-Data/Police-Data", exist_ok=True)
os.makedirs("Datasets/Processed-Data/Map-Data", exist_ok=True)
os.makedirs("Datasets/Processed-Data/Income-Data", exist_ok=True)
os.makedirs("Datasets/Processed-Data/Population-Data", exist_ok=True)
os.makedirs("Datasets/Processed-Data/Weather-Data", exist_ok=True)

## 2. Data Ingestion

### 2. 1. Police Data Ingestion

In [ ]:
# Download Police Data
!wget -O Datasets/Raw-Data/Police-Data/police_data_2020_2022.zip https://data.police.uk/data/archive/2022-12.zip
print("Downloaded police data from 2020 to 2022.")

!wget -O Datasets/Raw-Data/Police-Data/police_data_2022_2024.zip https://data.police.uk/data/archive/2024-12.zip
print("Downloaded police data from 2022 to 2024.")

In [ ]:
# Extract Police Data
!unzip -o Datasets/Raw-Data/Police-Data/police_data_2020_2022.zip -d Datasets/Raw-Data/Police-Data/
!unzip -o Datasets/Raw-Data/Police-Data/police_data_2022_2024.zip -d Datasets/Raw-Data/Police-Data/
print("Extracted police data zip files.")

### 2. 2. Map Data Ingestion

In [ ]:
# Download Map Data 

# Please Download LSOA and MSOA map data manually from the following links due to there being no direct download links available and place them in Raw-Data/Map-Data/
# LSOA Map Data - https://geoportal.statistics.gov.uk/datasets/6beafcfd9b9c4c9993a06b6b199d7e6d_0/explore?location=43.468898%2C-2.489483%2C3.79 (Both csv and geojson formats available)
# MSOA Map Data - https://geoportal.statistics.gov.uk/datasets/12baf1e6a44441208ffe5ba5ed063a68_0/explore?location=52.284503%2C-1.473701%2C11.49 (Both csv and geojson formats available)

# LSAO to MSOA Lookup Data
!wget -O Datasets/Raw-Data/Map-Data/LSOA_to_MSOA_Lookup_2021.zip https://www.arcgis.com/sharing/rest/content/items/c4f84c38814d4b82aa4760ade686c3cc/data
print("Downloaded LSOA to MSOA Lookup data.")

In [ ]:
!unzip -o Datasets/Raw-Data/Map-Data/LSOA_to_MSOA_Lookup_2021.zip -d Datasets/Raw-Data/Map-Data/
print("Extracted LSOA to MSOA Lookup data.")

### 2. 3. Income Data Ingestion

In [ ]:
# Download Income Data

# calculate other years - https://chatgpt.com/share/6969b116-6634-8007-a1da-6a3e3c8337b8
# 2023 income data
!wget -O Datasets/Raw-Data/Income-Data/Income_Data_MSOA_2023.xlsx https://www.ons.gov.uk/file?uri=/employmentandlabourmarket/peopleinwork/earningsandworkinghours/datasets/smallareaincomeestimatesformiddlelayersuperoutputareasenglandandwales/financialyearending2023/datasetfinal.xlsx
print("Downloaded 2023 income data.")

#2020 income data
!wget -O Datasets/Raw-Data/Income-Data/Income_Data_MSOA_2020.xlsx https://www.ons.gov.uk/file?uri=/employmentandlabourmarket/peopleinwork/earningsandworkinghours/datasets/smallareaincomeestimatesformiddlelayersuperoutputareasenglandandwales/financialyearending2020/saiefy1920finalqaddownload280923.xlsx    
print("Downloaded 2020 income data.")

### 2. 4. Population Data Ingestion

In [ ]:
# Download Population Data

# https://www.ons.gov.uk/peoplepopulationandcommunity/populationandmigration/populationestimates/datasets/lowersuperoutputareamidyearpopulationestimates

# Mid 2020 - 2021
!wget -O Datasets/Raw-Data/Population-Data/LSOA_Midyear_Population_Estimates_2020.xlsx https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/populationandmigration/populationestimates/datasets/lowersuperoutputareamidyearpopulationestimates/mid2020sape23dt2/sape23dt2mid2020lsoasyoaestimatesunformatted.xlsx

# Mid 2021 - 2022
!wget -O Datasets/Raw-Data/Population-Data/LSOA_Midyear_Population_Estimates_2021_2022.xlsx https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/populationandmigration/populationestimates/datasets/lowersuperoutputareamidyearpopulationestimates/mid2021andmid2022/sapelsoasyoatablefinal.xlsx

# Mid 2022 - 2024
!wget -O Datasets/Raw-Data/Population-Data/LSOA_Midyear_Population_Estimates_2022_2024.xlsx https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/populationandmigration/populationestimates/datasets/lowersuperoutputareamidyearpopulationestimates/mid2022revisednov2025tomid2024/sapelsoasyoa20222024.xlsx

### 2. 5. Whether Data Ingestion

In [ ]:
# Monthly Status only- https://www.metoffice.gov.uk/pub/data/weather/uk/climate/stationdata/heathrowdata.txt

!wget -O Datasets/Raw-Data/Weather-Data/Heathrow_Monthly_Weather_Data.txt https://www.metoffice.gov.uk/pub/data/weather/uk/climate/stationdata/heathrowdata.txt
print("Downloaded Heathrow monthly weather data.")

## 3. Data Preparation

### 3. 1. Import Libraries

In [2]:
import pandas as pd
from pathlib import Path
from typing import List

### 3. 2. Turn XLSX Files to CSV Files

In [ ]:
# List of Excel files
excel_files = [
    "Datasets/Raw-Data/Population-Data/LSOA_Midyear_Population_Estimates_2020.xlsx",
    "Datasets/Raw-Data/Population-Data/LSOA_Midyear_Population_Estimates_2021_2022.xlsx",
    "Datasets/Raw-Data/Population-Data/LSOA_Midyear_Population_Estimates_2022_2024.xlsx",
    "Datasets/Raw-Data/Income-Data/Income_Data_MSOA_2020.xlsx",
    "Datasets/Raw-Data/Income-Data/Income_Data_MSOA_2023.xlsx"
]

for file in excel_files:
    file_path = Path(file)
    output_dir = file_path.parent / "csv"
    output_dir.mkdir(exist_ok=True)

    # Load Excel file
    xls = pd.ExcelFile(file_path)

    for sheet in xls.sheet_names:
        df = pd.read_excel(xls, sheet_name=sheet)

        # Clean sheet name for filename
        safe_sheet_name = sheet.replace(" ", "_").replace("/", "_")

        output_file = output_dir / f"{file_path.stem}_{safe_sheet_name}.csv"
        df.to_csv(output_file, index=False)

        print(f"Saved: {output_file}")

### 3. 3. Copy Files to the Data-For-Processing Folder (Without Police Data)

In [ ]:
# Copy only the Necessary Files

# MAP Data
!cp Datasets/Raw-Data/Map-Data/PCD_OA21_LSOA21_MSOA21_LAD_NOV25_UK_LU.csv Datasets/Data-For-Processing/Map-Data/LSOA_to_MSOA_Lookup.csv
!cp Datasets/Raw-Data/Map-Data/Map-LSOA-2021.csv Datasets/Data-For-Processing/Map-Data/Map-LSOA.csv
!cp Datasets/Raw-Data/Map-Data/Map-MSOA-2021.csv Datasets/Data-For-Processing/Map-Data/Map-MSOA.csv

# Income Data
!cp Datasets/Raw-Data/Income-Data/csv/Income_Data_MSOA_2020_Total_annual_income.csv Datasets/Data-For-Processing/Income-Data/Total_Annual_Income_2020_MSOA.csv
!cp Datasets/Raw-Data/Income-Data/csv/Income_Data_MSOA_2023_Total_annual_income.csv Datasets/Data-For-Processing/Income-Data/Total_Annual_Income_2023_MSOA.csv

# Population Data
!cp Datasets/Raw-Data/Population-Data/csv/LSOA_Midyear_Population_Estimates_2020_Mid-2020_Persons.csv Datasets/Data-For-Processing/Population-Data/Population_2020_LSOA.csv
!cp Datasets/Raw-Data/Population-Data/csv/LSOA_Midyear_Population_Estimates_2021_2022_Mid-2021_LSOA_2021.csv Datasets/Data-For-Processing/Population-Data/Population_2021_LSOA.csv
!cp Datasets/Raw-Data/Population-Data/csv/LSOA_Midyear_Population_Estimates_2022_2024_Mid-2022_LSOA_2021.csv Datasets/Data-For-Processing/Population-Data/Population_2022_LSOA.csv
!cp Datasets/Raw-Data/Population-Data/csv/LSOA_Midyear_Population_Estimates_2022_2024_Mid-2023_LSOA_2021.csv Datasets/Data-For-Processing/Population-Data/Population_2023_LSOA.csv
!cp Datasets/Raw-Data/Population-Data/csv/LSOA_Midyear_Population_Estimates_2022_2024_Mid-2024_LSOA_2021.csv Datasets/Data-For-Processing/Population-Data/Population_2024_LSOA.csv

# Weather Data
!cp Datasets/Raw-Data/Weather-Data/Heathrow_Monthly_Weather_Data.txt Datasets/Data-For-Processing/Weather-Data/Heathrow_Monthly_Weather_1948_2025.txt

### 3. 4. Copy Police Data to the Data-For-Processing Folder

#### 3. 4. 1. Removing Non-Metropolitan Street Data from Police Data (Raw-Data Folder)

In [ ]:
police_root = Path("Datasets/Raw-Data/Police-Data")
date_range = ("2022-01", "2024-12")
keep_token = "metropolitan-street"

if not police_root.exists():
    raise FileNotFoundError(f"Missing directory: {police_root}")

kept: List[Path] = []
removed: List[Path] = []

# Delete every police file that does not belong to the Metropolitan force.
for file_path in police_root.rglob("*"):
    if not file_path.is_file():
        continue
    if keep_token in file_path.name.lower():
        kept.append(file_path)
        continue
    file_path.unlink()
    removed.append(file_path)

print(f"Date Range - {date_range[0]} - {date_range[1]}")
for path in sorted(kept):
    print(path)

print(f"Removed {len(removed)} other files.")

#### 3. 4. 2. Create a Single Police Data File

In [ ]:
police_data_root = Path("Datasets/Raw-Data/Police-Data")

def load_police_dataset(file_glob: str) -> pd.DataFrame:
    """Load all monthly police CSVs matching the glob into a single pandas DataFrame."""
    
    # Find matching CSV files recursively
    matches: List[Path] = sorted(police_data_root.rglob(file_glob))
    
    if not matches:
        raise FileNotFoundError(f"No police files matched pattern: {file_glob}")
    
    print(f"Matched {len(matches)} files for pattern '{file_glob}'")

    # Read and concatenate all CSVs
    dfs = [
        pd.read_csv(path, low_memory=False)
        for path in matches
    ]

    df = pd.concat(dfs, ignore_index=True)

    return df

police_street_df = load_police_dataset("*-metropolitan-street.csv")

# Simple sanity checks

print("Combined police street rows:", len(police_street_df))

police_street_df.to_csv("Datasets/Raw-Data/Police-Data/Police_Street_Data_2020_2024_LSOA.csv", index=False)

#### 3. 4. 3. Copy Police Data to the Data-For-Processing Folder

In [ ]:
!cp Datasets/Raw-Data/Police-Data/Police_Street_Data_2020_2024_LSOA.csv Datasets/Data-For-Processing/Police-Data/Police_Street_Data_2020_2024_LSOA.csv

## 4.  Data Cleaning

### 4. 1. Police Data Cleaning

#### 4. 1. 2. Read the combined police street data CSV

In [3]:
street_police_df = pd.read_csv("Datasets/Raw-Data/Police-Data/Police_Street_Data_2020_2024_LSOA.csv")

In [4]:
street_police_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5635649 entries, 0 to 5635648
Data columns (total 12 columns):
 #   Column                 Dtype
---  ------                 -----
 0   Crime ID               object
 1   Month                  object
 2   Reported by            object
 3   Falls within           object
 4   Longitude              float64
 5   Latitude               float64
 6   Location               object
 7   LSOA code              object
 8   LSOA name              object
 9   Crime type             object
 10  Last outcome category  object
 11  Context                float64
dtypes: float64(3), object(9)
memory usage: 516.0+ MB

In [5]:
street_police_df.head()

,Crime ID,Month,Reported by,Falls within,Longitude,Latitude,Location,LSOA code,LSOA name,Crime type,Last outcome category,Context
0,24c2b43c34c7cd6ef847d69fbb042c9c730b1eebe95c52...,2020-01,Metropolitan Police Service,Metropolitan Police Service,-0.539301,50.817200,On or near Highdown Drive,E01031469,Arun 009F,Other theft,Status update unavailable,NaN
1,NaN,2020-01,Metropolitan Police Service,Metropolitan Police Service,0.137065,51.583672,On or near Police Station,E01000027,Barking and Dagenham 001A,Anti-social behaviour,NaN,NaN
2,NaN,2020-01,Metropolitan Police Service,Metropolitan Police Service,0.137065,51.583672,On or near Police Station,E01000027,Barking and Dagenham 001A,Anti-social behaviour,NaN,NaN
3,NaN,2020-01,Metropolitan Police Service,Metropolitan Police Service,0.137065,51.583672,On or near Police Station,E01000027,Barking and Dagenham 001A,Anti-social behaviour,NaN,NaN
4,NaN,2020-01,Metropolitan Police Service,Metropolitan Police Service,0.134947,51.588063,On or near Mead Grove,E01000027,Barking and Dagenham 001A,Anti-social behaviour,NaN,NaN

#### 4. 1. 2.  Rename Police Data Columns for Clarity

In [6]:
street_police_df.rename(columns={
    "Crime ID": "Crime_ID",
    "Month": "Date",
    "Reported by": "Reported_By",
    "Falls within": "Falls_Within",
    "LSOA code": "LSOA_Code",
    "LSOA name": "LSOA_Name",
    "Crime type": "Crime_Type",
    "Last outcome category": "Last_Outcome_Category",
}, inplace=True)

#### 4. 1. 4. Cheack For Null Values

In [7]:
street_police_df.isnull().sum()

Crime_ID                 1426672
Date                           0
Reported_By                    0
Falls_Within                   0
Longitude                  71338
Latitude                   71338
Location                       0
LSOA_Code                  71339
LSOA_Name                  71339
Crime_Type                     0
Last_Outcome_Category    1426672
Context                  5635649
dtype: int64

In [8]:
# Drop rows where LSOA_Code is null/NaN (or blank just in case)
before = len(street_police_df)

street_police_df["LSOA_Code"] = street_police_df["LSOA_Code"].astype("object").str.strip()
street_police_df = street_police_df.dropna(subset=["LSOA_Code"])
street_police_df = street_police_df[street_police_df["LSOA_Code"] != ""]

after = len(street_police_df)
print(f"Dropped {before - after} rows with null/blank LSOA_Code. Remaining: {after}")

Dropped 71339 rows with null/blank LSOA_Code. Remaining: 5564310

In [9]:
# Replace missing values with meaningful placeholders
street_police_df["Crime_ID"] = street_police_df["Crime_ID"].fillna("No crime ID")
street_police_df["Last_Outcome_Category"] = street_police_df["Last_Outcome_Category"].fillna("No outcome mentioned")
street_police_df["Context"] = street_police_df["Context"].fillna("No context mentioned")

In [10]:
street_police_df.isnull().sum()

Crime_ID                 0
Date                     0
Reported_By              0
Falls_Within             0
Longitude                0
Latitude                 0
Location                 0
LSOA_Code                0
LSOA_Name                0
Crime_Type               0
Last_Outcome_Category    0
Context                  0
dtype: int64

### 4. 2. Map Data Cleaning

#### 4. 2. 1. Read the Map Data

In [11]:
MSOA_Map = pd.read_csv("Datasets/Data-For-Processing/Map-Data/Map-MSOA.csv")
LSOA_Map = pd.read_csv("Datasets/Data-For-Processing/Map-Data/Map-LSOA.csv")
Lookup_Map = pd.read_csv("Datasets/Data-For-Processing/Map-Data/LSOA_to_MSOA_Lookup.csv")

/tmp/ipykernel_2664/2072152009.py:3: DtypeWarning: Columns (13) have mixed types. Specify dtype option on import or set low_memory=False.
  Lookup_Map = pd.read_csv("Datasets/Data-For-Processing/Map-Data/LSOA_to_MSOA_Lookup.csv")

#### 4. 2. 2.  Clean MSOA_Map Data

In [12]:
MSOA_Map.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7264 entries, 0 to 7263
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   FID            7264 non-null   int64
 1   MSOA21CD       7264 non-null   object
 2   MSOA21NM       7264 non-null   object
 3   MSOA21NMW      7264 non-null   object
 4   BNG_E          7264 non-null   int64
 5   BNG_N          7264 non-null   int64
 6   LAT            7264 non-null   float64
 7   LONG           7264 non-null   float64
 8   Shape__Area    7264 non-null   float64
 9   Shape__Length  7264 non-null   float64
 10  GlobalID       7264 non-null   object
dtypes: float64(4), int64(3), object(4)
memory usage: 624.4+ KB

In [13]:
MSOA_Map.head()

,FID,MSOA21CD,MSOA21NM,MSOA21NMW,BNG_E,BNG_N,LAT,LONG,Shape__Area,Shape__Length,GlobalID
0,1,E02000001,City of London 001,,532384,181355,51.51562,-0.093490,2.885422e+06,9296.339891,6eac4c73-63e6-4757-8c84-da82c75d9cce
1,2,E02000002,Barking and Dagenham 001,,548267,189685,51.58652,0.138756,2.161561e+06,8306.888230,b44a90fd-98d3-4f82-ae29-1a9113b642c3
2,3,E02000003,Barking and Dagenham 002,,548259,188520,51.57606,0.138149,2.141515e+06,9359.512342,5c6778e4-1745-40bd-8bef-c475e0ba805b
3,4,E02000004,Barking and Dagenham 003,,551004,186412,51.55639,0.176828,2.492946e+06,8475.840309,3885032b-2f76-46f1-bfce-300f80a23638
4,5,E02000005,Barking and Dagenham 004,,548733,186824,51.56069,0.144267,1.187954e+06,7321.657104,2007dce4-81f5-4acf-9ddf-d40a3aad2b09

##### 4. 2. 2. 1. Rename MSOA Map Columns for Clarity

In [14]:
MSOA_Map.rename(columns={
    "MSOA21CD" : "MSOA_Code",
    "MSOA21NM" : "MSOA_Name",
    "LAT" : "Latitude",
    "LONG" : "Longitude",
    "BNG_E" : "British_National_Grid_Easting",
    "BNG_N" : "British_National_Grid_Northing",
    "Shape__Area" : "Shape_Area",
    "Shape__Length" : "Shape_Length",
}, inplace=True)

In [15]:
MSOA_Map.head()

,FID,MSOA_Code,MSOA_Name,MSOA21NMW,British_National_Grid_Easting,British_National_Grid_Northing,Latitude,Longitude,Shape_Area,Shape_Length,GlobalID
0,1,E02000001,City of London 001,,532384,181355,51.51562,-0.093490,2.885422e+06,9296.339891,6eac4c73-63e6-4757-8c84-da82c75d9cce
1,2,E02000002,Barking and Dagenham 001,,548267,189685,51.58652,0.138756,2.161561e+06,8306.888230,b44a90fd-98d3-4f82-ae29-1a9113b642c3
2,3,E02000003,Barking and Dagenham 002,,548259,188520,51.57606,0.138149,2.141515e+06,9359.512342,5c6778e4-1745-40bd-8bef-c475e0ba805b
3,4,E02000004,Barking and Dagenham 003,,551004,186412,51.55639,0.176828,2.492946e+06,8475.840309,3885032b-2f76-46f1-bfce-300f80a23638
4,5,E02000005,Barking and Dagenham 004,,548733,186824,51.56069,0.144267,1.187954e+06,7321.657104,2007dce4-81f5-4acf-9ddf-d40a3aad2b09

##### 4. 2. 2. 2. Cheack For Null Values

In [16]:
MSOA_Map.isnull().sum()

FID                               0
MSOA_Code                         0
MSOA_Name                         0
MSOA21NMW                         0
British_National_Grid_Easting     0
British_National_Grid_Northing    0
Latitude                          0
Longitude                         0
Shape_Area                        0
Shape_Length                      0
GlobalID                          0
dtype: int64

#### 4. 2. 3. Clean LSOA_Map Data

In [17]:
LSOA_Map.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 188880 entries, 0 to 188879
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   FID            188880 non-null  int64
 1   OA21CD         188880 non-null  object
 2   LSOA21CD       188880 non-null  object
 3   LSOA21NM       188880 non-null  object
 4   LSOA21NMW      188880 non-null  object
 5   BNG_E          188880 non-null  int64
 6   BNG_N          188880 non-null  int64
 7   LAT            188880 non-null  float64
 8   LONG           188880 non-null  float64
 9   Shape__Area    188880 non-null  float64
 10  Shape__Length  188880 non-null  float64
 11  GlobalID       188880 non-null  object
dtypes: float64(4), int64(3), object(5)
memory usage: 17.3+ MB

In [18]:
LSOA_Map.head()

,FID,OA21CD,LSOA21CD,LSOA21NM,LSOA21NMW,BNG_E,BNG_N,LAT,LONG,Shape__Area,Shape__Length,GlobalID
0,1,E00000001,E01000001,City of London 001A,,532250,181864,51.52022,-0.09523,6949.151482,421.166161,3a44dd3d-5082-4a09-9b9c-3a5fadc811ed
1,2,E00000003,E01000001,City of London 001A,,532171,181819,51.51983,-0.09638,4492.411072,307.714653,f1216dc8-14d1-4857-9230-cab0641758fb
2,3,E00000005,E01000001,City of London 001A,,532166,181722,51.51896,-0.09649,8565.514214,385.204781,44d6f70f-549c-4288-9b6d-de2adbf02582
3,4,E00000007,E01000001,City of London 001A,,532088,181473,51.51674,-0.09771,75994.829704,1408.607657,4dd683e1-9a5c-46cf-9e19-8465c8fbb6cb
4,5,E00000010,E01000003,City of London 001C,,532092,182114,51.52250,-0.09741,2102.876602,215.271975,7476781f-8fe4-4c9b-bde1-0eecbd146dff

##### 4. 2. 3. 1. Rename LSOA Map Columns for Clarity

In [19]:
LSOA_Map.rename(columns={
    "LSOA21CD" : "LSOA_Code",
    "LSOA21NM" : "LSOA_Name",
    "LAT" : "Latitude",
    "LONG" : "Longitude",
    "BNG_E" : "British_National_Grid_Easting",
    "BNG_N" : "British_National_Grid_Northing",
    "Shape__Area" : "Shape_Area",
    "Shape__Length" : "Shape_Length",
}, inplace=True)

In [20]:
LSOA_Map.head()

,FID,OA21CD,LSOA_Code,LSOA_Name,LSOA21NMW,British_National_Grid_Easting,British_National_Grid_Northing,Latitude,Longitude,Shape_Area,Shape_Length,GlobalID
0,1,E00000001,E01000001,City of London 001A,,532250,181864,51.52022,-0.09523,6949.151482,421.166161,3a44dd3d-5082-4a09-9b9c-3a5fadc811ed
1,2,E00000003,E01000001,City of London 001A,,532171,181819,51.51983,-0.09638,4492.411072,307.714653,f1216dc8-14d1-4857-9230-cab0641758fb
2,3,E00000005,E01000001,City of London 001A,,532166,181722,51.51896,-0.09649,8565.514214,385.204781,44d6f70f-549c-4288-9b6d-de2adbf02582
3,4,E00000007,E01000001,City of London 001A,,532088,181473,51.51674,-0.09771,75994.829704,1408.607657,4dd683e1-9a5c-46cf-9e19-8465c8fbb6cb
4,5,E00000010,E01000003,City of London 001C,,532092,182114,51.52250,-0.09741,2102.876602,215.271975,7476781f-8fe4-4c9b-bde1-0eecbd146dff

##### 4. 2. 3. 2. Cheack For Null Values

In [21]:
LSOA_Map.isnull().sum()

FID                               0
OA21CD                            0
LSOA_Code                         0
LSOA_Name                         0
LSOA21NMW                         0
British_National_Grid_Easting     0
British_National_Grid_Northing    0
Latitude                          0
Longitude                         0
Shape_Area                        0
Shape_Length                      0
GlobalID                          0
dtype: int64

#### 4. 2. 4. Clean LSOA_to_MSOA_Lookup Data

In [22]:
Lookup_Map.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2720556 entries, 0 to 2720555
Data columns (total 14 columns):
 #   Column    Dtype
---  ------    -----
 0   pcd7      object
 1   pcd8      object
 2   pcds      object
 3   dointr    int64
 4   doterm    float64
 5   usertype  int64
 6   oa21cd    object
 7   lsoa21cd  object
 8   msoa21cd  object
 9   ladcd     object
 10  lsoa21nm  object
 11  msoa21nm  object
 12  ladnm     object
 13  ladnmw    object
dtypes: float64(1), int64(2), object(11)
memory usage: 290.6+ MB

In [23]:
Lookup_Map.head()

,pcd7,pcd8,pcds,dointr,doterm,usertype,oa21cd,lsoa21cd,msoa21cd,ladcd,lsoa21nm,msoa21nm,ladnm,ladnmw
0,AB1 0AA,AB1 0AA,AB1 0AA,198001,199606.0,0,S00137176,S01013490,S02002516,S12000033,"Cults, Bieldside and Milltimber West - 02","Cults, Bieldside and Milltimber West",Aberdeen City,NaN
1,AB1 0AB,AB1 0AB,AB1 0AB,198001,199606.0,0,S00137176,S01013490,S02002516,S12000033,"Cults, Bieldside and Milltimber West - 02","Cults, Bieldside and Milltimber West",Aberdeen City,NaN
2,AB1 0AD,AB1 0AD,AB1 0AD,198001,199606.0,0,S00137176,S01013490,S02002516,S12000033,"Cults, Bieldside and Milltimber West - 02","Cults, Bieldside and Milltimber West",Aberdeen City,NaN
3,AB1 0AE,AB1 0AE,AB1 0AE,199402,199606.0,0,S00138891,S01013856,S02002577,S12000034,"Dunecht, Durris and Drumoak - 01","Dunecht, Durris and Drumoak",Aberdeenshire,NaN
4,AB1 0AF,AB1 0AF,AB1 0AF,199012,199207.0,1,S00137241,S01013487,S02002515,S12000033,Culter - 06,Culter,Aberdeen City,NaN

##### 4. 2. 4. 1. Rename Lookup Map Columns for Clarity

In [24]:
Lookup_Map.rename(columns={
    "lsoa21cd" : "LSOA_Code",
    "msoa21cd" : "MSOA_Code",
    "lsoa21nm" : "LSOA_Name",
    "msoa21nm" : "MSOA_Name",
}, inplace=True)

In [25]:
Lookup_Map.head()

,pcd7,pcd8,pcds,dointr,doterm,usertype,oa21cd,LSOA_Code,MSOA_Code,ladcd,LSOA_Name,MSOA_Name,ladnm,ladnmw
0,AB1 0AA,AB1 0AA,AB1 0AA,198001,199606.0,0,S00137176,S01013490,S02002516,S12000033,"Cults, Bieldside and Milltimber West - 02","Cults, Bieldside and Milltimber West",Aberdeen City,NaN
1,AB1 0AB,AB1 0AB,AB1 0AB,198001,199606.0,0,S00137176,S01013490,S02002516,S12000033,"Cults, Bieldside and Milltimber West - 02","Cults, Bieldside and Milltimber West",Aberdeen City,NaN
2,AB1 0AD,AB1 0AD,AB1 0AD,198001,199606.0,0,S00137176,S01013490,S02002516,S12000033,"Cults, Bieldside and Milltimber West - 02","Cults, Bieldside and Milltimber West",Aberdeen City,NaN
3,AB1 0AE,AB1 0AE,AB1 0AE,199402,199606.0,0,S00138891,S01013856,S02002577,S12000034,"Dunecht, Durris and Drumoak - 01","Dunecht, Durris and Drumoak",Aberdeenshire,NaN
4,AB1 0AF,AB1 0AF,AB1 0AF,199012,199207.0,1,S00137241,S01013487,S02002515,S12000033,Culter - 06,Culter,Aberdeen City,NaN

##### 4. 2. 4. 2. Cheack For Null Values

In [26]:
Lookup_Map.isnull().sum()

pcd7               0
pcd8               0
pcds               0
dointr             0
doterm       1807072
usertype           0
oa21cd         11007
LSOA_Code      11007
MSOA_Code      11007
ladcd          11007
LSOA_Name      84435
MSOA_Name      84667
ladnm          11007
ladnmw       2579358
dtype: int64

In [27]:
# Drop rows where LSOA_Code is null/NaN 
before = len(Lookup_Map)

Lookup_Map["LSOA_Code"] = Lookup_Map["LSOA_Code"].astype("object").str.strip()
Lookup_Map = Lookup_Map.dropna(subset=["LSOA_Code"])
Lookup_Map = Lookup_Map[Lookup_Map["LSOA_Code"] != ""]
after = len(Lookup_Map)

print(f"Dropped {before - after} rows with null/blank LSOA_Code. Remaining: {after}")

Dropped 11007 rows with null/blank LSOA_Code. Remaining: 2709549

In [28]:
# Replace missing values with meaningful placeholders
Lookup_Map["LSOA_Name"] = Lookup_Map["LSOA_Name"].fillna("No LSOA Name")
Lookup_Map["MSOA_Name"] = Lookup_Map["MSOA_Name"].fillna("No MSOA Name")

In [29]:
Lookup_Map.isnull().sum()

pcd7               0
pcd8               0
pcds               0
dointr             0
doterm       1805387
usertype           0
oa21cd             0
LSOA_Code          0
MSOA_Code          0
ladcd              0
LSOA_Name          0
MSOA_Name          0
ladnm              0
ladnmw       2568351
dtype: int64

### 4. 3. Income Data Cleaning

#### 4. 3. 1. Read the Income Data

In [30]:
Income_Data_2020 = pd.read_csv("Datasets/Data-For-Processing/Income-Data/Total_Annual_Income_2020_MSOA.csv",
                            skiprows=4
                                )
Income_Data_2023 = pd.read_csv("Datasets/Data-For-Processing/Income-Data/Total_Annual_Income_2023_MSOA.csv",
                            skiprows=3
                                )

#### 4. 3. 2. Clean 2020 Income Data

In [31]:
Income_Data_2020.head()

,MSOA code,MSOA name,Local authority code,Local authority name,Region code,Region name,Total annual income (),Upper confidence limit (),Lower confidence limit (),Confidence interval ()
0,E02004297,County Durham 001,E06000047,County Durham,E12000001,North East,41400,49100,34900,14200
1,E02004290,County Durham 002,E06000047,County Durham,E12000001,North East,41100,48800,34700,14100
2,E02004298,County Durham 003,E06000047,County Durham,E12000001,North East,44300,52500,37300,15200
3,E02004299,County Durham 004,E06000047,County Durham,E12000001,North East,35400,42000,29900,12100
4,E02004291,County Durham 005,E06000047,County Durham,E12000001,North East,34500,40900,29100,11800

In [32]:
Income_Data_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7201 entries, 0 to 7200
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   MSOA code                   7201 non-null   object
 1   MSOA name                   7201 non-null   object
 2   Local authority code        7201 non-null   object
 3   Local authority name        7201 non-null   object
 4   Region code                 7201 non-null   object
 5   Region name                 7201 non-null   object
 6   Total annual income ()     7201 non-null   int64
 7   Upper confidence limit ()  7201 non-null   int64
 8   Lower confidence limit ()  7201 non-null   int64
 9   Confidence interval ()     7201 non-null   int64
dtypes: int64(4), object(6)
memory usage: 562.7+ KB

##### 4. 3. 2. 1. Rename Income 2020 Columns for Clarity

In [33]:
Income_Data_2020.rename(columns={
    "MSOA code" : "MSOA_Code",
    "MSOA name" : "MSOA_Name",
    "Total annual income ()" : "Total_Annual_Income_British_Pounds"
}, inplace=True)

In [34]:
Income_Data_2020.head()

,MSOA_Code,MSOA_Name,Local authority code,Local authority name,Region code,Region name,Total_Annual_Income_British_Pounds,Upper confidence limit (),Lower confidence limit (),Confidence interval ()
0,E02004297,County Durham 001,E06000047,County Durham,E12000001,North East,41400,49100,34900,14200
1,E02004290,County Durham 002,E06000047,County Durham,E12000001,North East,41100,48800,34700,14100
2,E02004298,County Durham 003,E06000047,County Durham,E12000001,North East,44300,52500,37300,15200
3,E02004299,County Durham 004,E06000047,County Durham,E12000001,North East,35400,42000,29900,12100
4,E02004291,County Durham 005,E06000047,County Durham,E12000001,North East,34500,40900,29100,11800

In [35]:
# Check for null values
Income_Data_2020.isnull().sum()

MSOA_Code                             0
MSOA_Name                             0
Local authority code                  0
Local authority name                  0
Region code                           0
Region name                           0
Total_Annual_Income_British_Pounds    0
Upper confidence limit ()            0
Lower confidence limit ()            0
Confidence interval ()               0
dtype: int64

#### 4. 3. 3. Clean 2023 Income Data

In [36]:
Income_Data_2023.head()

,MSOA code,MSOA name,Local authority code,Local authority name,Region code,Region name,Total annual income (),Upper confidence limit (),Lower confidence limit (),Confidence interval ()
0,E02002483,Hartlepool 001,E06000001,Hartlepool,E12000001,North East,50689,59296,43332,15964
1,E02002484,Hartlepool 002,E06000001,Hartlepool,E12000001,North East,32399,37948,27661,10287
2,E02002485,Hartlepool 003,E06000001,Hartlepool,E12000001,North East,38135,44530,32659,11871
3,E02002489,Hartlepool 007,E06000001,Hartlepool,E12000001,North East,34225,40057,29242,10815
4,E02002490,Hartlepool 008,E06000001,Hartlepool,E12000001,North East,37845,44326,32311,12015

In [37]:
Income_Data_2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7264 entries, 0 to 7263
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   MSOA code                   7264 non-null   object
 1   MSOA name                   7264 non-null   object
 2   Local authority code        7264 non-null   object
 3   Local authority name        7264 non-null   object
 4   Region code                 7264 non-null   object
 5   Region name                 7264 non-null   object
 6   Total annual income ()     7264 non-null   int64
 7   Upper confidence limit ()  7264 non-null   int64
 8   Lower confidence limit ()  7264 non-null   int64
 9   Confidence interval ()     7264 non-null   int64
dtypes: int64(4), object(6)
memory usage: 567.6+ KB

##### 4. 3. 3. 1. Rename Income 2020 Columns for Clarity

In [38]:
Income_Data_2023.rename(columns={
    "MSOA code" : "MSOA_Code",
    "MSOA name" : "MSOA_Name",
    "Total annual income ()" : "Total_Annual_Income_British_Pounds"
}, inplace=True)

In [39]:
Income_Data_2023.head()

,MSOA_Code,MSOA_Name,Local authority code,Local authority name,Region code,Region name,Total_Annual_Income_British_Pounds,Upper confidence limit (),Lower confidence limit (),Confidence interval ()
0,E02002483,Hartlepool 001,E06000001,Hartlepool,E12000001,North East,50689,59296,43332,15964
1,E02002484,Hartlepool 002,E06000001,Hartlepool,E12000001,North East,32399,37948,27661,10287
2,E02002485,Hartlepool 003,E06000001,Hartlepool,E12000001,North East,38135,44530,32659,11871
3,E02002489,Hartlepool 007,E06000001,Hartlepool,E12000001,North East,34225,40057,29242,10815
4,E02002490,Hartlepool 008,E06000001,Hartlepool,E12000001,North East,37845,44326,32311,12015

In [40]:
# Check for null values
Income_Data_2023.isnull().sum()

MSOA_Code                             0
MSOA_Name                             0
Local authority code                  0
Local authority name                  0
Region code                           0
Region name                           0
Total_Annual_Income_British_Pounds    0
Upper confidence limit ()            0
Lower confidence limit ()            0
Confidence interval ()               0
dtype: int64

### 4. 4. Population Data Cleaning

In [41]:
population_2020 = pd.read_csv("Datasets/Data-For-Processing/Population-Data/Population_2020_LSOA.csv", skiprows=4)
population_2021 = pd.read_csv("Datasets/Data-For-Processing/Population-Data/Population_2021_LSOA.csv", skiprows=3)
population_2022 = pd.read_csv("Datasets/Data-For-Processing/Population-Data/Population_2022_LSOA.csv", skiprows=3)
population_2023 = pd.read_csv("Datasets/Data-For-Processing/Population-Data/Population_2023_LSOA.csv", skiprows=3)
population_2024 = pd.read_csv("Datasets/Data-For-Processing/Population-Data/Population_2024_LSOA.csv", skiprows=3)

#### 4. 4. 1. Clean 2020 Population Data

In [42]:
population_2020.head()

,LSOA Code,LSOA Name,LA Code (2018 boundaries),LA name (2018 boundaries),LA Code (2021 boundaries),LA name (2021 boundaries),All Ages,0.0,1.0,2.0,...,81.0,82.0,83.0,84.0,85.0,86.0,87.0,88.0,89.0,90+
0,E01011949,Hartlepool 009A,E06000001,Hartlepool,E06000001,Hartlepool,1944,20.0,32.0,22.0,...,2.0,9.0,14.0,9.0,8.0,7.0,9.0,2.0,2.0,7
1,E01011950,Hartlepool 008A,E06000001,Hartlepool,E06000001,Hartlepool,1298,14.0,18.0,15.0,...,5.0,3.0,1.0,2.0,2.0,2.0,3.0,2.0,1.0,4
2,E01011951,Hartlepool 007A,E06000001,Hartlepool,E06000001,Hartlepool,1208,18.0,13.0,12.0,...,10.0,7.0,2.0,4.0,4.0,5.0,1.0,1.0,4.0,2
3,E01011952,Hartlepool 002A,E06000001,Hartlepool,E06000001,Hartlepool,1724,23.0,20.0,32.0,...,10.0,13.0,14.0,7.0,17.0,18.0,12.0,10.0,8.0,67
4,E01011953,Hartlepool 002B,E06000001,Hartlepool,E06000001,Hartlepool,2026,27.0,20.0,32.0,...,4.0,6.0,6.0,10.0,1.0,2.0,4.0,1.0,4.0,9

In [43]:
population_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34753 entries, 0 to 34752
Data columns (total 98 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   LSOA Code                  34753 non-null  object
 1   LSOA Name                  34753 non-null  object
 2   LA Code (2018 boundaries)  34753 non-null  object
 3   LA name (2018 boundaries)  34753 non-null  object
 4   LA Code (2021 boundaries)  34753 non-null  object
 5   LA name (2021 boundaries)  34753 non-null  object
 6   All Ages                   34753 non-null  int64
 7   0.0                        34753 non-null  float64
 8   1.0                        34753 non-null  float64
 9   2.0                        34753 non-null  float64
 10  3.0                        34753 non-null  float64
 11  4.0                        34753 non-null  float64
 12  5.0                        34753 non-null  float64
 13  6.0                        34753 non-null  float64
 14  7.0                        34753 non-null  float64
 15  8.0                        34753 non-null  float64
 16  9.0                        34753 non-null  float64
 17  10.0                       34753 non-null  float64
 18  11.0                       34753 non-null  float64
 19  12.0                       34753 non-null  float64
 20  13.0                       34753 non-null  float64
 21  14.0                       34753 non-null  float64
 22  15.0                       34753 non-null  float64
 23  16.0                       34753 non-null  float64
 24  17.0                       34753 non-null  float64
 25  18.0                       34753 non-null  float64
 26  19.0                       34753 non-null  float64
 27  20.0                       34753 non-null  float64
 28  21.0                       34753 non-null  float64
 29  22.0                       34753 non-null  float64
 30  23.0                       34753 non-null  float64
 31  24.0                       34753 non-null  float64
 32  25.0                       34753 non-null  float64
 33  26.0                       34753 non-null  float64
 34  27.0                       34753 non-null  float64
 35  28.0                       34753 non-null  float64
 36  29.0                       34753 non-null  float64
 37  30.0                       34753 non-null  float64
 38  31.0                       34753 non-null  float64
 39  32.0                       34753 non-null  float64
 40  33.0                       34753 non-null  float64
 41  34.0                       34753 non-null  float64
 42  35.0                       34753 non-null  float64
 43  36.0                       34753 non-null  float64
 44  37.0                       34753 non-null  float64
 45  38.0                       34753 non-null  float64
 46  39.0                       34753 non-null  float64
 47  40.0                       34753 non-null  float64
 48  41.0                       34753 non-null  float64
 49  42.0                       34753 non-null  float64
 50  43.0                       34753 non-null  float64
 51  44.0                       34753 non-null  float64
 52  45.0                       34753 non-null  float64
 53  46.0                       34753 non-null  float64
 54  47.0                       34753 non-null  float64
 55  48.0                       34753 non-null  float64
 56  49.0                       34753 non-null  float64
 57  50.0                       34753 non-null  float64
 58  51.0                       34753 non-null  float64
 59  52.0                       34753 non-null  float64
 60  53.0                       34753 non-null  float64
 61  54.0                       34753 non-null  float64
 62  55.0                       34753 non-null  float64
 63  56.0                       34753 non-null  float64
 64  57.0                       34753 non-null  float64
 65  58.0                       34753 non-null  float64
 66  59.0                       34753 non-null  float64
 67  60.0                       34753 non-null  float64
 68  61.0                       34753 non-null  float64
 69  62.0                       34753 non-null  float64
 70  63.0                       34753 non-null  float64
 71  64.0                       34753 non-null  float64
 72  65.0                       34753 non-null  float64
 73  66.0                       34753 non-null  float64
 74  67.0                       34753 non-null  float64
 75  68.0                       34753 non-null  float64
 76  69.0                       34753 non-null  float64
 77  70.0                       34753 non-null  float64
 78  71.0                       34753 non-null  float64
 79  72.0                       34753 non-null  float64
 80  73.0                       34753 non-null  float64
 81  74.0                       34753 non-null  float64
 82  75.0                       34753 non-null  float64
 83  76.0                       34753 non-null  float64
 84  77.0                       34753 non-null  float64
 85  78.0                       34753 non-null  float64
 86  79.0                       34753 non-null  float64
 87  80.0                       34753 non-null  float64
 88  81.0                       34753 non-null  float64
 89  82.0                       34753 non-null  float64
 90  83.0                       34753 non-null  float64
 91  84.0                       34753 non-null  float64
 92  85.0                       34753 non-null  float64
 93  86.0                       34753 non-null  float64
 94  87.0                       34753 non-null  float64
 95  88.0                       34753 non-null  float64
 96  89.0                       34753 non-null  float64
 97  90+                        34753 non-null  int64
dtypes: float64(90), int64(2), object(6)
memory usage: 26.0+ MB

In [44]:
# Rename columns for clarity
population_2020.rename(columns={
    "LSOA Code" : "LSOA_Code",
    "LSOA Name" : "LSOA_Name",
    "All Ages" : "Total_Population"
}, inplace=True)

In [45]:
population_2020.head()

,LSOA_Code,LSOA_Name,LA Code (2018 boundaries),LA name (2018 boundaries),LA Code (2021 boundaries),LA name (2021 boundaries),Total_Population,0.0,1.0,2.0,...,81.0,82.0,83.0,84.0,85.0,86.0,87.0,88.0,89.0,90+
0,E01011949,Hartlepool 009A,E06000001,Hartlepool,E06000001,Hartlepool,1944,20.0,32.0,22.0,...,2.0,9.0,14.0,9.0,8.0,7.0,9.0,2.0,2.0,7
1,E01011950,Hartlepool 008A,E06000001,Hartlepool,E06000001,Hartlepool,1298,14.0,18.0,15.0,...,5.0,3.0,1.0,2.0,2.0,2.0,3.0,2.0,1.0,4
2,E01011951,Hartlepool 007A,E06000001,Hartlepool,E06000001,Hartlepool,1208,18.0,13.0,12.0,...,10.0,7.0,2.0,4.0,4.0,5.0,1.0,1.0,4.0,2
3,E01011952,Hartlepool 002A,E06000001,Hartlepool,E06000001,Hartlepool,1724,23.0,20.0,32.0,...,10.0,13.0,14.0,7.0,17.0,18.0,12.0,10.0,8.0,67
4,E01011953,Hartlepool 002B,E06000001,Hartlepool,E06000001,Hartlepool,2026,27.0,20.0,32.0,...,4.0,6.0,6.0,10.0,1.0,2.0,4.0,1.0,4.0,9

In [46]:
# Check for null values
population_2020.isnull().sum()

LSOA_Code                    0
LSOA_Name                    0
LA Code (2018 boundaries)    0
LA name (2018 boundaries)    0
LA Code (2021 boundaries)    0
                            ..
86.0                         0
87.0                         0
88.0                         0
89.0                         0
90+                          0
Length: 98, dtype: int64

#### 4. 4. 2. Clean 2021 Population Data

In [47]:
population_2021.head()

,LAD 2021 Code,LAD 2021 Name,LSOA 2021 Code,LSOA 2021 Name,Total,F0,F1,F2,F3,F4,...,M81,M82,M83,M84,M85,M86,M87,M88,M89,M90
0,E06000001,Hartlepool,E01011949,Hartlepool 009A,1854,5,10,10,10,0,...,4,5,6,6,6,0,0,6,0,0
1,E06000001,Hartlepool,E01011950,Hartlepool 008A,1037,7,5,10,5,5,...,0,5,0,6,0,0,0,0,0,0
2,E06000001,Hartlepool,E01011951,Hartlepool 007A,1203,7,10,5,5,5,...,0,5,0,0,0,5,0,0,0,0
3,E06000001,Hartlepool,E01011952,Hartlepool 002A,1610,8,16,16,14,5,...,4,0,4,6,0,6,5,0,0,11
4,E06000001,Hartlepool,E01011953,Hartlepool 002B,1970,12,21,16,14,19,...,4,0,4,0,6,0,0,0,0,5

In [48]:
population_2021.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35672 entries, 0 to 35671
Columns: 187 entries, LAD 2021 Code to M90
dtypes: int64(183), object(4)
memory usage: 50.9+ MB

In [49]:
# Rename columns for clarity
population_2021.rename(columns={
    "LSOA 2021 Code" : "LSOA_Code",
    "LSOA 2021 Name" : "LSOA_Name",
    "Total" : "Total_Population"
}, inplace=True)

In [50]:
population_2021.head()

,LAD 2021 Code,LAD 2021 Name,LSOA_Code,LSOA_Name,Total_Population,F0,F1,F2,F3,F4,...,M81,M82,M83,M84,M85,M86,M87,M88,M89,M90
0,E06000001,Hartlepool,E01011949,Hartlepool 009A,1854,5,10,10,10,0,...,4,5,6,6,6,0,0,6,0,0
1,E06000001,Hartlepool,E01011950,Hartlepool 008A,1037,7,5,10,5,5,...,0,5,0,6,0,0,0,0,0,0
2,E06000001,Hartlepool,E01011951,Hartlepool 007A,1203,7,10,5,5,5,...,0,5,0,0,0,5,0,0,0,0
3,E06000001,Hartlepool,E01011952,Hartlepool 002A,1610,8,16,16,14,5,...,4,0,4,6,0,6,5,0,0,11
4,E06000001,Hartlepool,E01011953,Hartlepool 002B,1970,12,21,16,14,19,...,4,0,4,0,6,0,0,0,0,5

In [51]:
# Check for null values
population_2021.isnull().sum()

LAD 2021 Code       0
LAD 2021 Name       0
LSOA_Code           0
LSOA_Name           0
Total_Population    0
                   ..
M86                 0
M87                 0
M88                 0
M89                 0
M90                 0
Length: 187, dtype: int64

#### 4. 4. 3. Clean 2022 Population Data

In [52]:
population_2022.head()

,LAD 2023 Code,LAD 2023 Name,LSOA 2021 Code,LSOA 2021 Name,Total,F0,F1,F2,F3,F4,...,M81,M82,M83,M84,M85,M86,M87,M88,M89,M90
0,E06000001,Hartlepool,E01011949,Hartlepool 009A,1876,16,2,12,13,5,...,4,4,3,3,4,3,1,1,3,1
1,E06000001,Hartlepool,E01011950,Hartlepool 008A,1117,5,6,9,6,4,...,1,1,3,2,0,0,0,0,0,0
2,E06000001,Hartlepool,E01011951,Hartlepool 007A,1260,7,6,5,8,3,...,2,1,4,0,3,3,2,0,0,1
3,E06000001,Hartlepool,E01011952,Hartlepool 002A,1635,14,12,17,15,14,...,1,4,1,3,3,4,4,5,0,11
4,E06000001,Hartlepool,E01011953,Hartlepool 002B,1984,9,13,18,11,13,...,2,4,2,3,0,1,0,0,2,2

In [53]:
population_2022.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35672 entries, 0 to 35671
Columns: 187 entries, LAD 2023 Code to M90
dtypes: int64(183), object(4)
memory usage: 50.9+ MB

In [54]:
# Rename columns for clarity
population_2022.rename(columns={
    "LSOA 2021 Code" : "LSOA_Code",
    "LSOA 2021 Name" : "LSOA_Name",
    "Total" : "Total_Population"
}, inplace=True)

In [55]:
population_2022.head()

,LAD 2023 Code,LAD 2023 Name,LSOA_Code,LSOA_Name,Total_Population,F0,F1,F2,F3,F4,...,M81,M82,M83,M84,M85,M86,M87,M88,M89,M90
0,E06000001,Hartlepool,E01011949,Hartlepool 009A,1876,16,2,12,13,5,...,4,4,3,3,4,3,1,1,3,1
1,E06000001,Hartlepool,E01011950,Hartlepool 008A,1117,5,6,9,6,4,...,1,1,3,2,0,0,0,0,0,0
2,E06000001,Hartlepool,E01011951,Hartlepool 007A,1260,7,6,5,8,3,...,2,1,4,0,3,3,2,0,0,1
3,E06000001,Hartlepool,E01011952,Hartlepool 002A,1635,14,12,17,15,14,...,1,4,1,3,3,4,4,5,0,11
4,E06000001,Hartlepool,E01011953,Hartlepool 002B,1984,9,13,18,11,13,...,2,4,2,3,0,1,0,0,2,2

In [56]:
# Check for null values
population_2022.isnull().sum()

LAD 2023 Code       0
LAD 2023 Name       0
LSOA_Code           0
LSOA_Name           0
Total_Population    0
                   ..
M86                 0
M87                 0
M88                 0
M89                 0
M90                 0
Length: 187, dtype: int64

#### 4. 4. 4. Clean 2023 Population Data

In [57]:
population_2023.head()

,LAD 2023 Code,LAD 2023 Name,LSOA 2021 Code,LSOA 2021 Name,Total,F0,F1,F2,F3,F4,...,M81,M82,M83,M84,M85,M86,M87,M88,M89,M90
0,E06000001,Hartlepool,E01011949,Hartlepool 009A,1925,7,15,4,12,17,...,2,5,6,3,1,3,2,2,0,3
1,E06000001,Hartlepool,E01011950,Hartlepool 008A,1177,11,7,6,10,10,...,3,0,2,0,0,1,1,0,0,1
2,E06000001,Hartlepool,E01011951,Hartlepool 007A,1320,5,10,10,6,7,...,0,2,1,2,2,2,2,0,1,1
3,E06000001,Hartlepool,E01011952,Hartlepool 002A,1670,11,15,8,16,14,...,4,2,3,2,5,5,1,4,4,6
4,E06000001,Hartlepool,E01011953,Hartlepool 002B,2075,7,9,15,19,12,...,2,3,4,2,2,0,0,0,0,3

In [58]:
population_2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35672 entries, 0 to 35671
Columns: 187 entries, LAD 2023 Code to M90
dtypes: int64(183), object(4)
memory usage: 50.9+ MB

In [59]:
# Rename columns for clarity
population_2023.rename(columns={
    "LSOA 2021 Code" : "LSOA_Code",
    "LSOA 2021 Name" : "LSOA_Name",
    "Total" : "Total_Population"
}, inplace=True)

In [60]:
population_2023.head()

,LAD 2023 Code,LAD 2023 Name,LSOA_Code,LSOA_Name,Total_Population,F0,F1,F2,F3,F4,...,M81,M82,M83,M84,M85,M86,M87,M88,M89,M90
0,E06000001,Hartlepool,E01011949,Hartlepool 009A,1925,7,15,4,12,17,...,2,5,6,3,1,3,2,2,0,3
1,E06000001,Hartlepool,E01011950,Hartlepool 008A,1177,11,7,6,10,10,...,3,0,2,0,0,1,1,0,0,1
2,E06000001,Hartlepool,E01011951,Hartlepool 007A,1320,5,10,10,6,7,...,0,2,1,2,2,2,2,0,1,1
3,E06000001,Hartlepool,E01011952,Hartlepool 002A,1670,11,15,8,16,14,...,4,2,3,2,5,5,1,4,4,6
4,E06000001,Hartlepool,E01011953,Hartlepool 002B,2075,7,9,15,19,12,...,2,3,4,2,2,0,0,0,0,3

In [61]:
# Check for null values
population_2023.isnull().sum()

LAD 2023 Code       0
LAD 2023 Name       0
LSOA_Code           0
LSOA_Name           0
Total_Population    0
                   ..
M86                 0
M87                 0
M88                 0
M89                 0
M90                 0
Length: 187, dtype: int64

#### 4. 4. 5. Clean 2024 Population Data

In [62]:
population_2024.head()

,LAD 2023 Code,LAD 2023 Name,LSOA 2021 Code,LSOA 2021 Name,Total,F0,F1,F2,F3,F4,...,M81,M82,M83,M84,M85,M86,M87,M88,M89,M90
0,E06000001,Hartlepool,E01011949,Hartlepool 009A,1898,6,7,16,3,11,...,3,3,4,5,1,1,2,2,2,3
1,E06000001,Hartlepool,E01011950,Hartlepool 008A,1247,11,10,7,14,13,...,0,2,1,0,0,1,0,0,0,0
2,E06000001,Hartlepool,E01011951,Hartlepool 007A,1393,5,11,9,9,12,...,1,0,0,1,3,2,0,1,0,1
3,E06000001,Hartlepool,E01011952,Hartlepool 002A,1669,10,12,12,10,17,...,0,3,2,1,3,3,3,2,4,5
4,E06000001,Hartlepool,E01011953,Hartlepool 002B,2303,15,15,7,20,22,...,3,3,4,3,3,1,0,1,0,2

In [63]:
population_2024.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35672 entries, 0 to 35671
Columns: 187 entries, LAD 2023 Code to M90
dtypes: int64(183), object(4)
memory usage: 50.9+ MB

In [64]:
# Rename columns for clarity
population_2024.rename(columns={
    "LSOA 2021 Code" : "LSOA_Code",
    "LSOA 2021 Name" : "LSOA_Name",
    "Total" : "Total_Population"
}, inplace=True)

In [65]:
population_2024.head()

,LAD 2023 Code,LAD 2023 Name,LSOA_Code,LSOA_Name,Total_Population,F0,F1,F2,F3,F4,...,M81,M82,M83,M84,M85,M86,M87,M88,M89,M90
0,E06000001,Hartlepool,E01011949,Hartlepool 009A,1898,6,7,16,3,11,...,3,3,4,5,1,1,2,2,2,3
1,E06000001,Hartlepool,E01011950,Hartlepool 008A,1247,11,10,7,14,13,...,0,2,1,0,0,1,0,0,0,0
2,E06000001,Hartlepool,E01011951,Hartlepool 007A,1393,5,11,9,9,12,...,1,0,0,1,3,2,0,1,0,1
3,E06000001,Hartlepool,E01011952,Hartlepool 002A,1669,10,12,12,10,17,...,0,3,2,1,3,3,3,2,4,5
4,E06000001,Hartlepool,E01011953,Hartlepool 002B,2303,15,15,7,20,22,...,3,3,4,3,3,1,0,1,0,2

In [66]:
# Check for null values
population_2024.isnull().sum()

LAD 2023 Code       0
LAD 2023 Name       0
LSOA_Code           0
LSOA_Name           0
Total_Population    0
                   ..
M86                 0
M87                 0
M88                 0
M89                 0
M90                 0
Length: 187, dtype: int64

### 4. 6. Whether Data Cleaning

In [67]:
weather_data = pd.read_fwf("Datasets/Data-For-Processing/Weather-Data/Heathrow_Monthly_Weather_1948_2025.txt", skiprows=5)

In [68]:
weather_data.head()

     yyyy   mm  tmax  tmin    af  rain    sun
0     NaN  NaN  degC  degC  days    mm  hours
1  1948.0  1.0   8.9   3.3   ---  85.0    ---
2  1948.0  2.0   7.9   2.2   ---  26.0    ---
3  1948.0  3.0  14.2   3.8   ---  14.0    ---
4  1948.0  4.0  15.4   5.1   ---  35.0    ---

In [69]:
weather_data.tail()

       yyyy    mm  tmax  tmin af  rain    sun
932  2025.0   8.0  25.0  14.1  0  23.0  192.0
933  2025.0   9.0  20.3  11.1  0  48.8  170.9
934  2025.0  10.0  15.8   9.7  0  52.8   70.5
935  2025.0  11.0  12.6   6.6  5  45.6   71.7
936  2025.0  12.0  10.4   4.8  2  53.8   67.1

In [70]:
weather_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 937 entries, 0 to 936
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   yyyy    936 non-null    float64
 1   mm      936 non-null    float64
 2   tmax    937 non-null    object
 3   tmin    937 non-null    object
 4   af      937 non-null    object
 5   rain    937 non-null    object
 6   sun     937 non-null    object
dtypes: float64(2), object(5)
memory usage: 51.4+ KB

In [71]:
# Drop the First Row which contains units
weather_data = weather_data.drop(index=0).reset_index(drop=True)

In [72]:
weather_data.head()

     yyyy   mm  tmax tmin   af  rain  sun
0  1948.0  1.0   8.9  3.3  ---  85.0  ---
1  1948.0  2.0   7.9  2.2  ---  26.0  ---
2  1948.0  3.0  14.2  3.8  ---  14.0  ---
3  1948.0  4.0  15.4  5.1  ---  35.0  ---
4  1948.0  5.0  18.1  6.9  ---  57.0  ---

In [73]:
# Rename columns for clarity
weather_data.rename(columns={
    "yyyy" : "Year",
    "mm" : "Month",
    "tmax" : "Max_Temperature_Celsius",
    "tmin" : "Min_Temperature_Celsius",
    "af" : "Air_Frost_Days",
    "rain" : "Rainfall_mm",
    "sun" : "Sunshine_Hours"
}, inplace=True)

In [74]:
# Check for null values
weather_data.isnull().sum()

Year                       0
Month                      0
Max_Temperature_Celsius    0
Min_Temperature_Celsius    0
Air_Frost_Days             0
Rainfall_mm                0
Sunshine_Hours             0
dtype: int64

## 5. Data Transformation

### 5.  1. Police Data Transformation

In [75]:
street_police_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5564310 entries, 0 to 5635648
Data columns (total 12 columns):
 #   Column                 Dtype
---  ------                 -----
 0   Crime_ID               object
 1   Date                   object
 2   Reported_By            object
 3   Falls_Within           object
 4   Longitude              float64
 5   Latitude               float64
 6   Location               object
 7   LSOA_Code              object
 8   LSOA_Name              object
 9   Crime_Type             object
 10  Last_Outcome_Category  object
 11  Context                object
dtypes: float64(2), object(10)
memory usage: 551.9+ MB

#### 5. 1. 1. Change the Data Types

In [76]:
street_police_df["Context"] = street_police_df["Context"].astype("object")
street_police_df["Date"] = street_police_df["Date"].astype("datetime64[ns]")

In [77]:
street_police_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5564310 entries, 0 to 5635648
Data columns (total 12 columns):
 #   Column                 Dtype
---  ------                 -----
 0   Crime_ID               object
 1   Date                   datetime64[ns]
 2   Reported_By            object
 3   Falls_Within           object
 4   Longitude              float64
 5   Latitude               float64
 6   Location               object
 7   LSOA_Code              object
 8   LSOA_Name              object
 9   Crime_Type             object
 10  Last_Outcome_Category  object
 11  Context                object
dtypes: datetime64[ns](1), float64(2), object(9)
memory usage: 551.9+ MB

#### 5. 1. 2. Date as a Time Period , Year and Month

In [78]:
street_police_df["Month_Period"] = pd.to_datetime(street_police_df["Date"], errors="coerce").dt.to_period("M")
street_police_df[["Date", "Month_Period"]].head()

street_police_df["Year"] = street_police_df["Date"].dt.year
street_police_df["Month"] = street_police_df["Date"].dt.month

In [79]:
street_police_df.tail()

,Crime_ID,Date,Reported_By,Falls_Within,Longitude,Latitude,Location,LSOA_Code,LSOA_Name,Crime_Type,Last_Outcome_Category,Context,Month_Period,Year,Month
5635644,36fcabb2c063f186635356d58681862de06217035a0bb3...,2024-12-01,Metropolitan Police Service,Metropolitan Police Service,-2.103086,52.600139,On or near Bushbury Road,E01010477,Wolverhampton 015F,Theft from the person,Investigation complete; no suspect identified,No context mentioned,2024-12,2024,12
5635645,7ddc1e3986e95f45c240b18f83bd691f6d9e1ffd48119c...,2024-12-01,Metropolitan Police Service,Metropolitan Police Service,-2.093462,52.587606,On or near Dean'S Road,E01010447,Wolverhampton 018E,Theft from the person,Investigation complete; no suspect identified,No context mentioned,2024-12,2024,12
5635646,01bad260b814aa7814b61aff2c75d1df1141ad833cfa92...,2024-12-01,Metropolitan Police Service,Metropolitan Police Service,-2.139659,52.577474,On or near Bristol Street,E01010466,Wolverhampton 020D,Violence and sexual offences,Under investigation,No context mentioned,2024-12,2024,12
5635647,67990b567541935fba7d1be7d072c0da6e6a97485e495a...,2024-12-01,Metropolitan Police Service,Metropolitan Police Service,-2.209463,52.193978,On or near Parking Area,E01032292,Worcester 011B,Theft from the person,Under investigation,No context mentioned,2024-12,2024,12
5635648,eda0c37f65ebf1308126e42ee5ceb1e89a3a766cce4530...,2024-12-01,Metropolitan Police Service,Metropolitan Police Service,-0.369572,50.817227,On or near Stanley Road,E01031788,Worthing 011B,Violence and sexual offences,Under investigation,No context mentioned,2024-12,2024,12

In [80]:
street_police_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5564310 entries, 0 to 5635648
Data columns (total 15 columns):
 #   Column                 Dtype
---  ------                 -----
 0   Crime_ID               object
 1   Date                   datetime64[ns]
 2   Reported_By            object
 3   Falls_Within           object
 4   Longitude              float64
 5   Latitude               float64
 6   Location               object
 7   LSOA_Code              object
 8   LSOA_Name              object
 9   Crime_Type             object
 10  Last_Outcome_Category  object
 11  Context                object
 12  Month_Period           period[M]
 13  Year                   int32
 14  Month                  int32
dtypes: datetime64[ns](1), float64(2), int32(2), object(9), period[M](1)
memory usage: 636.8+ MB

#### 5. 1. 3. Save Relevent Police Data

In [81]:
# Create a simplified DataFrame with only relevant columns
street_police_df_simple = street_police_df[["Crime_ID", "Longitude", "Latitude", "Location", "LSOA_Code", "LSOA_Name", "Crime_Type", "Last_Outcome_Category", "Month_Period", "Year", "Month"]]

In [82]:
# Save cleaned police data
street_police_df_simple.to_csv("Datasets/Processed-Data/Police-Data/Street_Police_Data_Cleaned_LSAO_2020_2024.csv", index=False)

### 5. 2. Population Data Transformation

#### 5. 2. 1. Population 2020 Data Transformation

In [83]:
population_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34753 entries, 0 to 34752
Data columns (total 98 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   LSOA_Code                  34753 non-null  object
 1   LSOA_Name                  34753 non-null  object
 2   LA Code (2018 boundaries)  34753 non-null  object
 3   LA name (2018 boundaries)  34753 non-null  object
 4   LA Code (2021 boundaries)  34753 non-null  object
 5   LA name (2021 boundaries)  34753 non-null  object
 6   Total_Population           34753 non-null  int64
 7   0.0                        34753 non-null  float64
 8   1.0                        34753 non-null  float64
 9   2.0                        34753 non-null  float64
 10  3.0                        34753 non-null  float64
 11  4.0                        34753 non-null  float64
 12  5.0                        34753 non-null  float64
 13  6.0                        34753 non-null  float64
 14  7.0                        34753 non-null  float64
 15  8.0                        34753 non-null  float64
 16  9.0                        34753 non-null  float64
 17  10.0                       34753 non-null  float64
 18  11.0                       34753 non-null  float64
 19  12.0                       34753 non-null  float64
 20  13.0                       34753 non-null  float64
 21  14.0                       34753 non-null  float64
 22  15.0                       34753 non-null  float64
 23  16.0                       34753 non-null  float64
 24  17.0                       34753 non-null  float64
 25  18.0                       34753 non-null  float64
 26  19.0                       34753 non-null  float64
 27  20.0                       34753 non-null  float64
 28  21.0                       34753 non-null  float64
 29  22.0                       34753 non-null  float64
 30  23.0                       34753 non-null  float64
 31  24.0                       34753 non-null  float64
 32  25.0                       34753 non-null  float64
 33  26.0                       34753 non-null  float64
 34  27.0                       34753 non-null  float64
 35  28.0                       34753 non-null  float64
 36  29.0                       34753 non-null  float64
 37  30.0                       34753 non-null  float64
 38  31.0                       34753 non-null  float64
 39  32.0                       34753 non-null  float64
 40  33.0                       34753 non-null  float64
 41  34.0                       34753 non-null  float64
 42  35.0                       34753 non-null  float64
 43  36.0                       34753 non-null  float64
 44  37.0                       34753 non-null  float64
 45  38.0                       34753 non-null  float64
 46  39.0                       34753 non-null  float64
 47  40.0                       34753 non-null  float64
 48  41.0                       34753 non-null  float64
 49  42.0                       34753 non-null  float64
 50  43.0                       34753 non-null  float64
 51  44.0                       34753 non-null  float64
 52  45.0                       34753 non-null  float64
 53  46.0                       34753 non-null  float64
 54  47.0                       34753 non-null  float64
 55  48.0                       34753 non-null  float64
 56  49.0                       34753 non-null  float64
 57  50.0                       34753 non-null  float64
 58  51.0                       34753 non-null  float64
 59  52.0                       34753 non-null  float64
 60  53.0                       34753 non-null  float64
 61  54.0                       34753 non-null  float64
 62  55.0                       34753 non-null  float64
 63  56.0                       34753 non-null  float64
 64  57.0                       34753 non-null  float64
 65  58.0                       34753 non-null  float64
 66  59.0                       34753 non-null  float64
 67  60.0                       34753 non-null  float64
 68  61.0                       34753 non-null  float64
 69  62.0                       34753 non-null  float64
 70  63.0                       34753 non-null  float64
 71  64.0                       34753 non-null  float64
 72  65.0                       34753 non-null  float64
 73  66.0                       34753 non-null  float64
 74  67.0                       34753 non-null  float64
 75  68.0                       34753 non-null  float64
 76  69.0                       34753 non-null  float64
 77  70.0                       34753 non-null  float64
 78  71.0                       34753 non-null  float64
 79  72.0                       34753 non-null  float64
 80  73.0                       34753 non-null  float64
 81  74.0                       34753 non-null  float64
 82  75.0                       34753 non-null  float64
 83  76.0                       34753 non-null  float64
 84  77.0                       34753 non-null  float64
 85  78.0                       34753 non-null  float64
 86  79.0                       34753 non-null  float64
 87  80.0                       34753 non-null  float64
 88  81.0                       34753 non-null  float64
 89  82.0                       34753 non-null  float64
 90  83.0                       34753 non-null  float64
 91  84.0                       34753 non-null  float64
 92  85.0                       34753 non-null  float64
 93  86.0                       34753 non-null  float64
 94  87.0                       34753 non-null  float64
 95  88.0                       34753 non-null  float64
 96  89.0                       34753 non-null  float64
 97  90+                        34753 non-null  int64
dtypes: float64(90), int64(2), object(6)
memory usage: 26.0+ MB

In [84]:
# Add Year column
population_2020["Year"] = 2020

# Create a simplified DataFrame with only relevant columns
population_2020_simple = population_2020[["LSOA_Code", "LSOA_Name", "Total_Population", "Year"]]
population_2020_simple.head()

   LSOA_Code        LSOA_Name  Total_Population  Year
0  E01011949  Hartlepool 009A              1944  2020
1  E01011950  Hartlepool 008A              1298  2020
2  E01011951  Hartlepool 007A              1208  2020
3  E01011952  Hartlepool 002A              1724  2020
4  E01011953  Hartlepool 002B              2026  2020

#### 5. 2. 2. Population 2021 Data Transformation

In [85]:
population_2021.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35672 entries, 0 to 35671
Columns: 187 entries, LAD 2021 Code to M90
dtypes: int64(183), object(4)
memory usage: 50.9+ MB

In [86]:
# Add Year column
population_2021["Year"] = 2021

# Create a simplified DataFrame with only relevant columns
population_2021_simple = population_2021[["LSOA_Code", "LSOA_Name", "Total_Population", "Year"]]
population_2021_simple.head()

   LSOA_Code        LSOA_Name  Total_Population  Year
0  E01011949  Hartlepool 009A              1854  2021
1  E01011950  Hartlepool 008A              1037  2021
2  E01011951  Hartlepool 007A              1203  2021
3  E01011952  Hartlepool 002A              1610  2021
4  E01011953  Hartlepool 002B              1970  2021

#### 5. 2. 3. Population 2022 Data Transformation

In [87]:
population_2022.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35672 entries, 0 to 35671
Columns: 187 entries, LAD 2023 Code to M90
dtypes: int64(183), object(4)
memory usage: 50.9+ MB

In [88]:
# Add Year column
population_2022["Year"] = 2022

# Create a simplified DataFrame with only relevant columns
population_2022_simple = population_2022[["LSOA_Code", "LSOA_Name", "Total_Population", "Year"]]
population_2022_simple.head()

   LSOA_Code        LSOA_Name  Total_Population  Year
0  E01011949  Hartlepool 009A              1876  2022
1  E01011950  Hartlepool 008A              1117  2022
2  E01011951  Hartlepool 007A              1260  2022
3  E01011952  Hartlepool 002A              1635  2022
4  E01011953  Hartlepool 002B              1984  2022

#### 5. 2. 4. Population 2023 Data Transformation

In [89]:
population_2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35672 entries, 0 to 35671
Columns: 187 entries, LAD 2023 Code to M90
dtypes: int64(183), object(4)
memory usage: 50.9+ MB

In [90]:
# Add Year column
population_2023["Year"] = 2023

# Create a simplified DataFrame with only relevant columns
population_2023_simple = population_2023[["LSOA_Code", "LSOA_Name", "Total_Population", "Year"]]
population_2023_simple.head()

   LSOA_Code        LSOA_Name  Total_Population  Year
0  E01011949  Hartlepool 009A              1925  2023
1  E01011950  Hartlepool 008A              1177  2023
2  E01011951  Hartlepool 007A              1320  2023
3  E01011952  Hartlepool 002A              1670  2023
4  E01011953  Hartlepool 002B              2075  2023

#### 5. 2. 5. Population 2024 Data Transformation

In [91]:
population_2024.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35672 entries, 0 to 35671
Columns: 187 entries, LAD 2023 Code to M90
dtypes: int64(183), object(4)
memory usage: 50.9+ MB

In [92]:
# Add Year column
population_2024["Year"] = 2024

# Create a simplified DataFrame with only relevant columns
population_2024_simple = population_2024[["LSOA_Code", "LSOA_Name", "Total_Population", "Year"]]
population_2024_simple.head()

   LSOA_Code        LSOA_Name  Total_Population  Year
0  E01011949  Hartlepool 009A              1898  2024
1  E01011950  Hartlepool 008A              1247  2024
2  E01011951  Hartlepool 007A              1393  2024
3  E01011952  Hartlepool 002A              1669  2024
4  E01011953  Hartlepool 002B              2303  2024

#### 5. 2. 6. Combine All Data in to a One Dataset

In [93]:
# Combine all years into a single DataFrame
combined_population = pd.concat([
    population_2020_simple,
    population_2021_simple,
    population_2022_simple,
    population_2023_simple,
    population_2024_simple
], ignore_index=True)

In [94]:
combined_population.head()

   LSOA_Code        LSOA_Name  Total_Population  Year
0  E01011949  Hartlepool 009A              1944  2020
1  E01011950  Hartlepool 008A              1298  2020
2  E01011951  Hartlepool 007A              1208  2020
3  E01011952  Hartlepool 002A              1724  2020
4  E01011953  Hartlepool 002B              2026  2020

In [95]:
# Save cleaned population data
combined_population.to_csv("Datasets/Processed-Data/Population-Data/Population_Cleaned_LSOA_2020_2024.csv", index=False)

### 5. 3. Map Data Transformation

#### 5. 3. 1. LSOA Map Transformation

In [96]:
LSOA_Map.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 188880 entries, 0 to 188879
Data columns (total 12 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   FID                             188880 non-null  int64
 1   OA21CD                          188880 non-null  object
 2   LSOA_Code                       188880 non-null  object
 3   LSOA_Name                       188880 non-null  object
 4   LSOA21NMW                       188880 non-null  object
 5   British_National_Grid_Easting   188880 non-null  int64
 6   British_National_Grid_Northing  188880 non-null  int64
 7   Latitude                        188880 non-null  float64
 8   Longitude                       188880 non-null  float64
 9   Shape_Area                      188880 non-null  float64
 10  Shape_Length                    188880 non-null  float64
 11  GlobalID                        188880 non-null  object
dtypes: float64(4), int64(3), object(5)
memory usage: 17.3+ MB

In [97]:
# Create a simplified DataFrame with only relevant columns
LSOA_Map_Simple = LSOA_Map[["LSOA_Code", "LSOA_Name", "Latitude", "Longitude", "British_National_Grid_Easting", "British_National_Grid_Northing", "Shape_Area", "Shape_Length"]]

In [98]:
# Save cleaned LSOA map data
LSOA_Map_Simple.to_csv("Datasets/Processed-Data/Map-Data/LSOA_Map_Cleaned.csv", index=False)

#### 5. 3. 2. MSOA Map Transformation

In [99]:
MSOA_Map.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7264 entries, 0 to 7263
Data columns (total 11 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   FID                             7264 non-null   int64
 1   MSOA_Code                       7264 non-null   object
 2   MSOA_Name                       7264 non-null   object
 3   MSOA21NMW                       7264 non-null   object
 4   British_National_Grid_Easting   7264 non-null   int64
 5   British_National_Grid_Northing  7264 non-null   int64
 6   Latitude                        7264 non-null   float64
 7   Longitude                       7264 non-null   float64
 8   Shape_Area                      7264 non-null   float64
 9   Shape_Length                    7264 non-null   float64
 10  GlobalID                        7264 non-null   object
dtypes: float64(4), int64(3), object(4)
memory usage: 624.4+ KB

In [100]:
# Create a simplified DataFrame with only relevant columns
MSOA_Map_Simple = MSOA_Map[["MSOA_Code", "MSOA_Name", "Latitude", "Longitude", "British_National_Grid_Easting", "British_National_Grid_Northing", "Shape_Area", "Shape_Length"]]

In [101]:
# Save cleaned MSOA map data
MSOA_Map_Simple.to_csv("Datasets/Processed-Data/Map-Data/MSOA_Map_Cleaned.csv", index=False)

#### 5. 3. 3. LSOA to MSOA Lookup Map Transformation

In [102]:
Lookup_Map.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2709549 entries, 0 to 2720555
Data columns (total 14 columns):
 #   Column     Dtype
---  ------     -----
 0   pcd7       object
 1   pcd8       object
 2   pcds       object
 3   dointr     int64
 4   doterm     float64
 5   usertype   int64
 6   oa21cd     object
 7   LSOA_Code  object
 8   MSOA_Code  object
 9   ladcd      object
 10  LSOA_Name  object
 11  MSOA_Name  object
 12  ladnm      object
 13  ladnmw     object
dtypes: float64(1), int64(2), object(11)
memory usage: 310.1+ MB

In [103]:
# Create a simplified DataFrame with only relevant columns
Lookup_Map_Simple = Lookup_Map[["LSOA_Code", "MSOA_Code", "LSOA_Name", "MSOA_Name"]]

In [104]:
# Save cleaned LSOA to MSOA lookup data
Lookup_Map_Simple.to_csv("Datasets/Processed-Data/Map-Data/LSOA_MSOA_Lookup_Cleaned.csv", index=False)

### 5. 4. Weather Data Transformation

In [105]:
weather_data.head()

,Year,Month,Max_Temperature_Celsius,Min_Temperature_Celsius,Air_Frost_Days,Rainfall_mm,Sunshine_Hours
0,1948.0,1.0,8.9,3.3,---,85.0,---
1,1948.0,2.0,7.9,2.2,---,26.0,---
2,1948.0,3.0,14.2,3.8,---,14.0,---
3,1948.0,4.0,15.4,5.1,---,35.0,---
4,1948.0,5.0,18.1,6.9,---,57.0,---

#### 5. 4. 1. Convert Year and Month to Month_Period

In [106]:
# Convert Year and Month to Month_Period
weather_data["Month_Period"] = pd.to_datetime(
    weather_data["Year"].astype(int).astype(str) + "-" + weather_data["Month"].astype(int).astype(str).str.zfill(2),
    format="%Y-%m"
).dt.to_period("M")
weather_data[["Year", "Month", "Month_Period"]].head()

     Year  Month Month_Period
0  1948.0    1.0      1948-01
1  1948.0    2.0      1948-02
2  1948.0    3.0      1948-03
3  1948.0    4.0      1948-04
4  1948.0    5.0      1948-05

In [107]:
weather_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 936 entries, 0 to 935
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Year                     936 non-null    float64
 1   Month                    936 non-null    float64
 2   Max_Temperature_Celsius  936 non-null    object
 3   Min_Temperature_Celsius  936 non-null    object
 4   Air_Frost_Days           936 non-null    object
 5   Rainfall_mm              936 non-null    object
 6   Sunshine_Hours           936 non-null    object
 7   Month_Period             936 non-null    period[M]
dtypes: float64(2), object(5), period[M](1)
memory usage: 58.6+ KB

In [108]:
# Save cleaned weather data
weather_data.to_csv("Datasets/Processed-Data/Weather-Data/Heathrow_Monthly_Weather_Cleaned_1948_2025.csv", index=False)

### 5. 5. Income Data Transformation

In [109]:
Income_Data_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7201 entries, 0 to 7200
Data columns (total 10 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   MSOA_Code                           7201 non-null   object
 1   MSOA_Name                           7201 non-null   object
 2   Local authority code                7201 non-null   object
 3   Local authority name                7201 non-null   object
 4   Region code                         7201 non-null   object
 5   Region name                         7201 non-null   object
 6   Total_Annual_Income_British_Pounds  7201 non-null   int64
 7   Upper confidence limit ()          7201 non-null   int64
 8   Lower confidence limit ()          7201 non-null   int64
 9   Confidence interval ()             7201 non-null   int64
dtypes: int64(4), object(6)
memory usage: 562.7+ KB

In [110]:
Income_Data_2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7264 entries, 0 to 7263
Data columns (total 10 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   MSOA_Code                           7264 non-null   object
 1   MSOA_Name                           7264 non-null   object
 2   Local authority code                7264 non-null   object
 3   Local authority name                7264 non-null   object
 4   Region code                         7264 non-null   object
 5   Region name                         7264 non-null   object
 6   Total_Annual_Income_British_Pounds  7264 non-null   int64
 7   Upper confidence limit ()          7264 non-null   int64
 8   Lower confidence limit ()          7264 non-null   int64
 9   Confidence interval ()             7264 non-null   int64
dtypes: int64(4), object(6)
memory usage: 567.6+ KB

In [111]:
Income_Data_2020_Simple = Income_Data_2020[["MSOA_Code", "MSOA_Name", "Total_Annual_Income_British_Pounds"]].copy()

In [112]:
Income_Data_2023_Simple = Income_Data_2023[["MSOA_Code", "MSOA_Name", "Total_Annual_Income_British_Pounds"]].copy()

### Calculate Median Income Across 2021 to 2022 Based on Total_Annual_Income_2020_MSOA.csv

In [113]:
# Median and mean equivalised household disposable income of individuals, UK, 1977 to financial year ending (FYE) 2024
!wget -O Datasets/Data-For-Processing/Income-Data/Income_Data_1977_2024.csv "https://www.ons.gov.uk/generator?uri=/peoplepopulationandcommunity/personalandhouseholdfinances/incomeandwealth/bulletins/householddisposableincomeandinequality/financialyearending2024/3a82baa3&format=csv"

--2026-01-16 04:24:57--  https://www.ons.gov.uk/generator?uri=/peoplepopulationandcommunity/personalandhouseholdfinances/incomeandwealth/bulletins/householddisposableincomeandinequality/financialyearending2024/3a82baa3&format=csv
Resolving www.ons.gov.uk (www.ons.gov.uk)... 104.16.69.85, 104.16.68.85, 2606:4700::6810:4555, ...
Connecting to www.ons.gov.uk (www.ons.gov.uk)|104.16.69.85|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: unspecified [application/octet-stream]
Saving to: Datasets/Data-For-Processing/Income-Data/Income_Data_1977_2024.csv

Datasets/Data-For-P     [ <=>                ]   2.53K  --.-KB/s    in 0s

2026-01-16 04:24:58 (31.1 MB/s) - Datasets/Data-For-Processing/Income-Data/Income_Data_1977_2024.csv saved [2592]

In [114]:
median_1977_2024_income = pd.read_csv("Datasets/Data-For-Processing/Income-Data/Income_Data_1977_2024.csv", skiprows=6)

In [115]:
median_1977_2024_income.tail()

,Year,Mean equivalised household disposable income,Median equivalised household disposable income
42,FYE 2020,45108,36671
43,FYE 2021,44850,37414
44,FYE 2022,45338,37306
45,FYE 2023,43198,36384
46,FYE 2024,42684,36663

In [116]:
# Clean Year column
median_1977_2024_income["Year"] = median_1977_2024_income["Year"].astype(str).str.extract(r'(\d{4})').astype(int)

In [117]:
median_1977_2024_income.rename(columns={
    "Mean equivalised household disposable income" : "Mean_Income_British_Pounds",
    "Median equivalised household disposable income" : "Median_Income_British_Pounds"
}, inplace=True)

In [118]:
median_1977_2024_income.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 3 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Year                          47 non-null     int64
 1   Mean_Income_British_Pounds    47 non-null     int64
 2   Median_Income_British_Pounds  47 non-null     int64
dtypes: int64(3)
memory usage: 1.2 KB

### Create  UK Income Index for 2020

In [119]:
# Compute index: Index_year = UK_median_year / UK_median_2020
median_2020 = median_1977_2024_income.loc[median_1977_2024_income['Year'] == 2020, 'Median_Income_British_Pounds'].iloc[0]
median_1977_2024_income['Income_Index_2020'] = median_1977_2024_income['Median_Income_British_Pounds'] / median_2020

# Round the Income_Index to 5 decimal places
median_1977_2024_income['Income_Index_2020'] = median_1977_2024_income['Income_Index_2020'].round(5)

### Create  UK Income Index for 2023

In [120]:
# Compute index: Index_year = UK_median_year / UK_median_2020
median_2023 = median_1977_2024_income.loc[median_1977_2024_income['Year'] == 2023, 'Median_Income_British_Pounds'].iloc[0]
median_1977_2024_income['Income_Index_2023'] = median_1977_2024_income['Median_Income_British_Pounds'] / median_2023

# Round the Income_Index to 5 decimal places
median_1977_2024_income['Income_Index_2023'] = median_1977_2024_income['Income_Index_2023'].round(5)

In [121]:
median_1977_2024_income.tail()

,Year,Mean_Income_British_Pounds,Median_Income_British_Pounds,Income_Index_2020,Income_Index_2023
42,2020,45108,36671,1.00000,1.00789
43,2021,44850,37414,1.02026,1.02831
44,2022,45338,37306,1.01732,1.02534
45,2023,43198,36384,0.99217,1.00000
46,2024,42684,36663,0.99978,1.00767

### Scale MSOA incomes using Total_Annual_Income_2020_MSOA.csv for 2021 and 2022

### Scaled 2021 Income Data

In [122]:
Income_Data_2020_Simple.head()

   MSOA_Code          MSOA_Name  Total_Annual_Income_British_Pounds
0  E02004297  County Durham 001                               41400
1  E02004290  County Durham 002                               41100
2  E02004298  County Durham 003                               44300
3  E02004299  County Durham 004                               35400
4  E02004291  County Durham 005                               34500

In [123]:
Income_Data_2021_Simple = Income_Data_2020_Simple.copy()
Income_Data_2021_Simple.loc[:, "Total_Annual_Income_British_Pounds"] = (
    Income_Data_2020_Simple["Total_Annual_Income_British_Pounds"] * 1.02026
).round().astype(int)
Income_Data_2021_Simple.head()

   MSOA_Code          MSOA_Name  Total_Annual_Income_British_Pounds
0  E02004297  County Durham 001                               42239
1  E02004290  County Durham 002                               41933
2  E02004298  County Durham 003                               45198
3  E02004299  County Durham 004                               36117
4  E02004291  County Durham 005                               35199

### Scaled 2022 Income Data

In [124]:
Income_Data_2022_Simple = Income_Data_2020_Simple.copy()
Income_Data_2022_Simple.loc[:, "Total_Annual_Income_British_Pounds"] = (
    Income_Data_2020_Simple["Total_Annual_Income_British_Pounds"] * 1.01732
).round().astype(int)
Income_Data_2022_Simple.head()

   MSOA_Code          MSOA_Name  Total_Annual_Income_British_Pounds
0  E02004297  County Durham 001                               42117
1  E02004290  County Durham 002                               41812
2  E02004298  County Durham 003                               45067
3  E02004299  County Durham 004                               36013
4  E02004291  County Durham 005                               35098

### Scale MSOA incomes using Total_Annual_Income_2023_MSOA.csv for 2024

In [125]:
Income_Data_2023_Simple.head()

   MSOA_Code       MSOA_Name  Total_Annual_Income_British_Pounds
0  E02002483  Hartlepool 001                               50689
1  E02002484  Hartlepool 002                               32399
2  E02002485  Hartlepool 003                               38135
3  E02002489  Hartlepool 007                               34225
4  E02002490  Hartlepool 008                               37845

### Scaled 2024 Income Data

In [126]:
Income_Data_2024_Simple = Income_Data_2023_Simple.copy()
Income_Data_2024_Simple.loc[:, "Total_Annual_Income_British_Pounds"] = (
    Income_Data_2023_Simple["Total_Annual_Income_British_Pounds"] * 1.00767
).round().astype(int)
Income_Data_2024_Simple.head()

   MSOA_Code       MSOA_Name  Total_Annual_Income_British_Pounds
0  E02002483  Hartlepool 001                               51078
1  E02002484  Hartlepool 002                               32648
2  E02002485  Hartlepool 003                               38427
3  E02002489  Hartlepool 007                               34488
4  E02002490  Hartlepool 008                               38135

In [127]:
Income_Data_2020_Simple["Year"] = 2020
Income_Data_2021_Simple["Year"] = 2021
Income_Data_2022_Simple["Year"] = 2022
Income_Data_2023_Simple["Year"] = 2023
Income_Data_2024_Simple["Year"] = 2024

In [128]:
Combined_income = pd.concat([
    Income_Data_2020_Simple,
    Income_Data_2021_Simple,
    Income_Data_2022_Simple,
    Income_Data_2023_Simple,
    Income_Data_2024_Simple
], ignore_index=True)

In [134]:
Combined_income.to_csv("Datasets/Processed-Data/Income-Data/Income_Cleaned_MSOA_2020_2024.csv", index=False)

In [135]:
combined_population.head()

   LSOA_Code        LSOA_Name  Total_Population  Year
0  E01011949  Hartlepool 009A              1944  2020
1  E01011950  Hartlepool 008A              1298  2020
2  E01011951  Hartlepool 007A              1208  2020
3  E01011952  Hartlepool 002A              1724  2020
4  E01011953  Hartlepool 002B              2026  2020

In [136]:
Combined_income.head()

   MSOA_Code          MSOA_Name  Total_Annual_Income_British_Pounds  Year
0  E02004297  County Durham 001                               41400  2020
1  E02004290  County Durham 002                               41100  2020
2  E02004298  County Durham 003                               44300  2020
3  E02004299  County Durham 004                               35400  2020
4  E02004291  County Durham 005                               34500  2020